# GetText

## Description
Function GetText returns the text contained within the referenced text object.

```pascal
FUNCTION GetText(objectHd : HANDLE): DYNARRAY[] of CHAR;
```

```python
def vs.GetText(objectHd):
    return DYNARRAY[] of CHAR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHd|HANDLE|Handle to text object.|

## See Also
VS Functions:
SetText

## Version
Availability: from All Versions

## Category
* Objects - Text